{
    "id": "be94ab73-58c3-446a-8fd0-b1821558ce2a",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg7.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:03",
    "wordCount": 2344,
    "pageContent": "In one prominent attack, hackers stole $140,000 in BTC through a man-in-the-\nmiddle attack that morphed copied & pasted deposit addresses into ones of the \nhackers’ choosing.\nA number of methods have been utilized to mitigate the threat of deposit address \ncompromise. Some of the most common methods for securing deposit addresses \ninclude test transfers, whitelisting, and hardware wallets. Though these security \nmeasures have their benefits, there are also certain issues with them that should \nbe considered:\n\tSTest transfers are meant to ensure that the deposit address has not been \ncompromised in transit—which could occur by hackers intercepting and \nmodifying the deposit address, and ultimately sending assets to their own \nwallet. Though this manual security protocol adds another layer of safety, test \ntransfers can be very time-consuming and far from foolproof.\n\tSWhitelisting asks a number of professionals within an organization to devote \ntime to a manual procedure. While it can be a powerful security measure, \nwhitelisting ultimately cannot prevent internal fraud, as a rogue employee can \ngo into the organization’s spreadsheet or database and swap out the deposit \naddress of a certain whitelisted counterparty for their own. In addition, \nwhitelisting cannot stop human errors (such as a simple fat-fingers error \nentering a deposit address into the whitelist, or a counterparty rotating a \ndeposit address without the correct re-entry procedure). \n\tSWith hardware wallets, the deposit address is displayed on a hardware \ndevice with a small screen. Unfortunately, if your computer has been \ncompromised, the deposit address that is presented on the hardware device \nwill be fraudulent. The assumption being made with hardware wallets is that \nit’s impossible to compromise the hardware wallet because of its hardware \nisolation. However, hardware wallets cannot prevent interference with the \nuser’s computer.\nCredentials and Authentication\nOne of the most common methods hackers use to compromise digital assets \nis impersonating a user within an organization. As the digital asset ecosystem \nis interconnected, the hackers can utilize the credentials and authentication of \nthe user to either compromise wallets in custody or accounts on exchanges and \n8\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 454
}