{
    "id": "0d513636-0ea6-4612-a8d3-4260ac571887",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg16.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:34",
    "wordCount": 1574,
    "pageContent": "In a similar fashion to multi-sig, the MPC-CMP private key protection layer \nremoves the single point of compromise from both external hackers and insiders \n– as the private key is never concentrated on a single device at any point in time.\nAt the same time, MPC’s distributed nature allows team members to require \nmultiple authorizers for a transaction and sign transactions without being in the \nsame location. Operationally, it’s a significant advancement over multisig due \nto its inherent flexibility; unlike multisig, MPC allows for ongoing modification \nand maintenance of the signature scheme. To use the example detailed above, \nchanging from a ‘3 of 4’ set-up to any other set-up would simply require existing \nshareholders to agree on the new distributed computation and the addition of a \nnew user share. In this process the blockchain wallet address (deposit address) \nis maintained, so that you don’t need to create a new wallet, move any funds, or \nprovide counterparties with a new address.FIREBLOCKS MPC-CMP WALLET GENERAL MPC WALLET\nDeployment Options PaaS, SaaS SDK, PaaSSingle point of private-key compromise\nSecure MPCNO\nSecure MPCNO\nHardware based isolation\nAll shares are chip-level isolatedYES NO\nSecure Transfer Environment for institutional \ntransfer and E2E authentication of deposit \naddresses with counterpartiesAll shares are chip-level isolatedYES NOCryptographic authentication for signature \naccess Passcode + bio / YubikeyYES NOMPC-CMP: A New Breakthrough in MPC Technology\n17\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 328
}