{
    "id": "e04044fd-3a0f-4c34-998d-5bb793f04bd0",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg19.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:34",
    "wordCount": 2027,
    "pageContent": "Layer 1: MPC + Multi-Cloud\nWe selected MPC over multisig to remove the single point of compromise from \nsensitive pieces of data (such as our users’ private keys) for several reasons:\n\tSOperational flexibility.  It’s important to us that our solution can stay on pace \nwith our users’ needs as their organizations grow, and multisig simply doesn’t \nallow that.\n\tSUnbiased.  MPC is the only key-sharing technology available that works across \nall blockchains.\n\tSCheap.  Wallets based on multisig are associated with higher fees than regular, \nsingle address transactions. MPC-based wallets, however, are represented on \nthe blockchain as a single wallet address, with the actual distributed signature \ncomputed outside of the blockchain. This means having the lowest fees \npossible for each transaction.\nUnlike multisig, MPC can \nalso be applied to API keys \nand credentials. Fireblocks \nrecently developed HMAC-\nMPC, an algorithm which \nuses MPC to remove the \nsingle point of compromise \nfrom API credentials. The \nFireblocks HMAC-MPC \nalgorithm also enables \nstoring the API key \nshares within an HSM-like \nenvironment, sealed using a \nhardware key.USING MPC FOR API \nKEYS & CREDENTIALS\tSFast.  MPC-CMP pushes MPC transactions speeds up to 8X \nfaster than ever before.\n \nFireblocks offers users multiple options for distributing the \ncryptographic MPC shares to ensure an extra layer of security even \nif one of the physical datacenters is compromised:\n\tSDistribution across multiple tier-1 cloud providers (Microsoft \nAzure and IBM Cloud) \n\tSDistribution across several on-prem datacenters \n\tSHybrid (on-prem datacenters and cloud providers (such as \nMicrosoft Azure) are used simultaneously)\nLayer 2: SGX\nFor the hardware layer of our security solution, we selected SGX \nover a traditional HSM. Using SGX enclaves on a minimum of 3 to \n5 machines (each of which on a segregated network), we distribute \nprivate keys with an extremely high level of security.\n20\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 448
}