{
    "id": "528b0152-686a-4292-b806-49c248993b1d",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg11.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:03",
    "wordCount": 2111,
    "pageContent": "Multisig\nMultisig (multi-signature) is a digital signing process that enables two or \nmore users to sign transactions as a group. Before multisig wallets entered \nthe mainstream, cryptocurrencies were generally stored using a single private \nkey. Whoever had access to the private key itself was able to access the funds \nassociated with that key. Multisig added an additional layer of security to the \nequation by creating wallets that require the signature from multiple keys.\nWhile multisig offers potential solutions to some of the problems of single-\nsignature wallets (e.g. the single point of failure), it also introduces new issues. \nThis is because when multisig was first introduced in 2012, the blockchain \nspace was different in a variety of ways. For example, bitcoin was the only \ncryptocurrency, so the concept of creating a security technology that would work \nacross multiple blockchains was irrelevant. In today’s digital asset landscape, \nmultisig-based solutions are outdated for the following reasons: \nMULTISIG IS NOT PROTOCOL AGNOSTIC\nNot all cryptocurrency protocols support multisig – and those who do have very \ndifferent implementations from one another. This makes it more difficult for \nmultisig wallet providers to support new chains.\nWith an on-chain multisig solution, each protocol requires the wallet provider to \nimplement a different code. When a multisig implementation goes wrong, various \nissues can arise:\n\tSThe Multi-Sig Parity Wallet - Poor implementation lead malicious actors to \nsteal around $30m worth of Ethereum in one of the biggest wallet hacks to \ndate.\n\tSParity Wallet Hacked (Again) - A hacker again gained access to the wallet and \nfroze $300m worth of Ethereum. Some customers lost up to $300k worth of \ndigital assets.\n\tSVulnerabilities in Bitcoin Multisig  - Discovered by the Fireblocks Research \nteam, a vulnerability in the bitcoin multisig check implementation was \ndeployed in development environments and, despite the popularity of this \ncodebase, the vulnerability still remains.\n \n12\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 439
}