{
    "id": "4153e00b-ed24-47bd-90a0-6926e4fbdab6",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg17.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:03",
    "wordCount": 1885,
    "pageContent": "MPC-CMP was designed to address new requirements of the digital asset space \nthat have emerged as institutions have entered the ecosystem – and it’s designed \nto be future-proof.\nIntel SGX (Software Guard Extension)\nIntel SGX is a hardware-level enclave that isolates selected code and data within \na system, similar to an HSM from the operating system. It is designed to protect \nthe cryptographic material, the cryptographic algorithm, and the execution of \nsensitive parts of the software from both insiders (such as rogue admins) and \nhackers. Compared to an HSM, SGX offers a variety of benefits, including:\n\tSThe ability to protect next-generation cryptographic algorithms such as MPC \nand zero-knowledge proofs \n\tSThe ability to isolate and protect policy engines, whitelisting databases, and \nworkflows from insiders and hackers\n\tSStrong, hardware isolated authentication of users by end-to-end attestation \nof  secure-enclaves (ARM TrustZone) in mobile devices and hardware tokens \n(such as Yubikey)  \n\tSHigh degree of scalability across public clouds and on-prem deployments, \nincreasing security, availability, and redundancy\nIn general, SGX offers a great deal of operational elasticity while providing the \nsecurity associated with a traditional HSM. For digital asset businesses that \nrequire the highest level of hardware-based security in tandem with speed and \nflexibility, SGX is a very strong option.\tSMulti-blockchain support\n\tSInstitutional user base with the ability to  \nadd and remove users to the quorum\n\tSLowest fees for blockchain transactions as the \n# of transactions increases 2X every 2 years\n\tSCompatibility with cold storage\tSUniversal composability\n\tS1 transaction round (6 to 9 rounds \nin all other MPC protocols)\n\tSAutomatic key refresh\n\tSOpen-source and peer-reviewedMPC-CMP offers:\n18\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 399
}