{
    "id": "ef80aee3-d475-4dc2-baeb-c5977aad1213",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg22.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:34",
    "wordCount": 1744,
    "pageContent": "Settlement Layer: The Fireblocks \nNetwork\nThe settlement layer of our multi-layer system is the Fireblocks Network, an \ninstitutional asset transfer network that completely mitigates the risks associated \nwith deposit addresses by automating deposit address authentication and \nrotation.\nThe Fireblocks Network entirely removes the need for copy-pasting deposit \naddresses and then authenticating them using time-consuming and risky test \ntransfers and whitelisting procedures. Without an authentication network, it’s \npossible for assets to be lost through deposit address spoofing or human errors \n(such as entering a deposit address for a counterparty that they’ve already rotated \nout). \nInstitutions on the Fireblocks Network settle trades within seconds, and don’t \nhave to worry about the possibility of asset loss due to a deposit address attack \nor error. \nThe Fireblocks Network is built using a patent-pending technology that is using \nthe latest breakthroughs in secure enclave technology and data-in-motion \nencryption. The sending wallet opens an encrypted tunnel with the recipient wallet \nto query for the deposit address to send the transaction to. The encrypted tunnel \nis protected within a secure enclave (hardware termination) on both the sending \nwallet and receiving wallet. This guarantees the following security capabilities:\n\tSFull mitigation of man-in-the-middle attacks on both the network and host \nlevels\n\tSProofing the the address at the source, and full authentication of the recipient \n\tSGuaranteed fail-close system if an attack is detected on either end\n\tSAutomatic rotation of deposit addresses on every transfer to preserve \npseudo-anonymity\n23\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 333
}