{
    "id": "f0471c91-c8e9-4f5b-bc46-3f56606be511",
    "url": "file:///home/rahul/Desktop/Hackathon/datascribe/collector/hotdir/processed/Fireblocks Security Whitepaper (2).pdf",
    "title": "Fireblocks Security Whitepaper (2)_pg8.pdf",
    "description": "a custom file uploaded by the user.",
    "published": "2023-06-24 23:39:34",
    "wordCount": 2007,
    "pageContent": "liquidity providers. Once the hackers are able to login, they can issue and authorize \nfraudulent transfers.\nOne of the most prominent examples of an attack based on compromised API \nkeys was the Binance exchange hack (May 2019). Hackers used phishing and \nviruses to obtain a large number of API keys. They made off with 7,074 BTC – \nworth more than $40 million on the day of the attack – in just one transaction.\nToday, institutions use chip-level hardware isolation and biometric factors to \nsecurely authenticate users and store API secrets. The unique security properties \nof chip-level hardware enclaves guarantee confidentiality and execution \nintegrity. In addition, Android and iPhones include hardware-isolated biometric \nauthentication capabilities. This prevents hackers and hosting providers from \naccessing credentials/keys and enables a strong multi-factor authentication of \nusers that is not susceptible to spoofing.1\n2\n3The oldest form of attack is achieved by compromising the username and \npassword (credentials) of an organization’s users and logging into that \norganization’s services on their behalf.\nIn addition many services require two-factor authentication (2FA). This is \ndesigned to protect against a compromise of user credentials. Unfortunately, \nmany services allow 2FA using SMS, which is susceptible to SIM swaps – and \nin extreme cases, hackers are able to deploy attacks that can defeat one-time \npassword (OTP) generators .\nExchanges and liquidity providers often have users utilize API keys for \nautomated access to their platforms. These keys are vulnerable to traditional \nforms of malware. API keys stored in trading software can also be stolen if the \nserver or code repository is compromised. In general, once a hacker obtains \nAPI keys, it’s possible for them to instruct unauthorized withdrawal of funds \nfrom an exchange or manipulate the market using pre-funded assets on a \ncompromised account.\n9\nFireblocks’ Multi-layer Philosophy for Securing Digital Assets",
    "token_count_estimate": 400
}